--- a/modulos/03-airflow/README.md
+++ b/modulos/03-airflow/README.md
@@ -50,20 +48,15 @@ graph TD
 
 #### 1.2 Arquitetura do Airflow
 
-```mermaid
-%%{init: { "themeVariables": { "fontFamily": "Arial", "fontSize": "10px" } }}%%
-flowchart LR
-    A[WebServer] --> B[Metadata DB]
-    C[Scheduler] --> B
-    D[Workers] --> B
-    E[DAG Files] --> C
-    E --> A
-    
-    style A fill:#f9f,stroke:#333,stroke-width:2px
-    style B fill:#bbf,stroke:#333,stroke-width:2px
-    style C fill:#bfb,stroke:#333,stroke-width:2px
-    style D fill:#fbf,stroke:#333,stroke-width:2px
-    style E fill:#ff9,stroke:#333,stroke-width:2px
+```
++------------+     +-------------+     +---------+
+| DAG Files  | --> |  Scheduler  | --> |         |
++------------+     +-------------+     |         |
+      |                               |Metadata |
+      v                               |   DB    |
++------------+     +-------------+    |         |
+| WebServer  | --> |  Workers   | --> |         |
++------------+     +-------------+     +---------+
 ```
 
 ### 2. Desenvolvimento de DAGs
