--- a/modulos/05-spark/README.md
+++ b/modulos/05-spark/README.md
@@ -25,20 +25,14 @@ Este módulo aborda os conceitos e práticas do Apache Spark para processamento 
 
 ### 1. Fundamentos do Spark
 
-```mermaid
-%%{init: { "themeVariables": { "fontFamily": "Arial", "fontSize": "10px" } }}%%
-graph TD
-    A[Driver] --> B[SparkContext]
-    B --> C[Executors]
-    C --> D[Tasks]
-    
-    E[RDD] --> F[DataFrame]
-    F --> G[SQL]
-    
-    style A fill:#f9f,stroke:#333,stroke-width:2px
-    style B fill:#bbf,stroke:#333,stroke-width:2px
-    style C fill:#bfb,stroke:#333,stroke-width:2px
-    style D fill:#fbf,stroke:#333,stroke-width:2px
+```
++---------+     +-------------+     +-----------+     +--------+
+| Driver  | --> |SparkContext | --> | Executors | --> | Tasks  |
++---------+     +-------------+     +-----------+     +--------+
+
++---------+     +-----------+     +--------+
+|  RDD    | --> | DataFrame | --> |  SQL   |
++---------+     +-----------+     +--------+
 ```
 
 #### 1.1 Conceitos Básicos
